Revit 2024 API
CustomFieldData Class
 A class that offer access to the information about a custom field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class CustomFieldData : IDisposable
Visual Basic
Public Class CustomFieldData _
	Implements IDisposable
Visual C++
public ref class CustomFieldData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CustomFieldData
See Also
CustomFieldData Members
Autodesk.Revit.DB Namespace